Tekla.Structures.Solid.Shell
The Shell class represents a single shell in a solid.

Tekla.Structures.Solid.Shell.edgeList
List of shell edges.

Tekla.Structures.Solid.Shell.faceList
List of shell faces.

Tekla.Structures.Solid.Shell.#ctor(System.Collections.Generic.List{Tekla.Structures.Solid.Edge},System.Collections.Generic.List{Tekla.Structures.Solid.Face})
Instantiates a new shell.
edgeList: A list of edges in the new shell.
faceList: A faces in the new shell.

Tekla.Structures.Solid.Shell.GetFaceEnumerator
Returns a new face enumerator in the current plane.
Returns: A face enumerator to enumerate through shell's faces.

Tekla.Structures.Solid.Shell.GetEdgeEnumerator
Returns a new edge enumerator in the current plane.
Returns: An edge enumerator to enumerate through the shell's edges.